ekawahyu/MSP430Ware/eclipse/plugins/com.ti.mcu.msp430.driverlib.product.ui_1.90.0.65/resources/empty/MSP430FR5xx_6xx/driverlib/MSP430FR5xx_6xx/comp_e.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// comp_e.c - Driver for the comp_e Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup comp_e_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_COMP_E__
#include "comp_e.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief Convert Driverlib input definition to register input definition.
//!
//! \param input Driverlib defintion for input
//!
//! \return register input definition
//
//*****************************************************************************
static uint16_t __getRegisterSettingForInput(uint32_t input)
{
    switch(input)
    {
        case COMP_E_INPUT0:
            return CEIPSEL_0;
        case COMP_E_INPUT1:
            return CEIPSEL_1;
        case COMP_E_INPUT2:
            return CEIPSEL_2;
        case COMP_E_INPUT3:
            return CEIPSEL_3;
        case COMP_E_INPUT4:
            return CEIPSEL_4;
        case COMP_E_INPUT5:
            return CEIPSEL_5;
        case COMP_E_INPUT6:
            return CEIPSEL_6;
        case COMP_E_INPUT7:
            return CEIPSEL_7;
        case COMP_E_INPUT8:
            return CEIPSEL_8;
        case COMP_E_INPUT9:
            return CEIPSEL_9;
        case COMP_E_INPUT10:
            return CEIPSEL_10;
        case COMP_E_INPUT11:
            return CEIPSEL_11;
        case COMP_E_INPUT12:
            return CEIPSEL_12;
        case COMP_E_INPUT13:
            return CEIPSEL_13;
        case COMP_E_INPUT14:
            return CEIPSEL_14;
        case COMP_E_INPUT15:
            return CEIPSEL_15;
        case COMP_E_VREF:
            return COMP_E_VREF;
        default:
            assert(false);
            return 0x11;
    }

}

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the COMP_E Module.
//!
//! Upon successful initialization of the COMP_E module, this function will
//! have reset all necessary register bits and set the given options in the
//! registers. To actually use the COMP_E module, the COMP_E_enable() function
//! must be explicitly called before use. If a Reference Voltage is set to a
//! terminal, the Voltage should be set using the setReferenceVoltage()
//! function.
//!
//! \param baseAddress is the base address of the COMP_E module.
//! \param posTerminalInput selects the input to the positive terminal.
//!        Valid values are:
//!        - \b COMP_E_INPUT0 [Default]
//!        - \b COMP_E_INPUT1
//!        - \b COMP_E_INPUT2
//!        - \b COMP_E_INPUT3
//!        - \b COMP_E_INPUT4
//!        - \b COMP_E_INPUT5
//!        - \b COMP_E_INPUT6
//!        - \b COMP_E_INPUT7
//!        - \b COMP_E_INPUT8
//!        - \b COMP_E_INPUT9
//!        - \b COMP_E_INPUT10
//!        - \b COMP_E_INPUT11
//!        - \b COMP_E_INPUT12
//!        - \b COMP_E_INPUT13
//!        - \b COMP_E_INPUT14
//!        - \b COMP_E_INPUT15
//!        - \b COMP_E_VREF
//!        \n Modified bits are \b CEPDx of \b CECTL3 register; bits \b CERSEL
//!        of \b CECTL2 register; bits \b CEIPEN and \b CEIPSEL of \b CECTL0
//!        register.
//! \param negTerminalInput selects the input to the negative terminal.
//!        Valid values are:
//!        - \b COMP_E_INPUT0 [Default]
//!        - \b COMP_E_INPUT1
//!        - \b COMP_E_INPUT2
//!        - \b COMP_E_INPUT3
//!        - \b COMP_E_INPUT4
//!        - \b COMP_E_INPUT5
//!        - \b COMP_E_INPUT6
//!        - \b COMP_E_INPUT7
//!        - \b COMP_E_INPUT8
//!        - \b COMP_E_INPUT9
//!        - \b COMP_E_INPUT10
//!        - \b COMP_E_INPUT11
//!        - \b COMP_E_INPUT12
//!        - \b COMP_E_INPUT13
//!        - \b COMP_E_INPUT14
//!        - \b COMP_E_INPUT15
//!        - \b COMP_E_VREF
//!        \n Modified bits are \b CEPDx of \b CECTL3 register; bits \b CERSEL
//!        of \b CECTL2 register; bits \b CEIMSEL of \b CECLT0 register; bits
//!        \b CEIMEN of \b CECTL0 register.
//! \param outputFilterEnableAndDelayLevel controls the output filter delay
//!        state, which is either off or enabled with a specified delay level.
//!        This parameter is device specific and delay levels should be found
//!        in the device's datasheet.
//!        Valid values are:
//!        - \b COMP_E_FILTEROUTPUT_OFF [Default]
//!        - \b COMP_E_FILTEROUTPUT_DLYLVL1
//!        - \b COMP_E_FILTEROUTPUT_DLYLVL2
//!        - \b COMP_E_FILTEROUTPUT_DLYLVL3
//!        - \b COMP_E_FILTEROUTPUT_DLYLVL4
//!        \n Modified bits are \b CEFDLY and \b CEF of \b CECTL1 register.
//! \param invertedOutputPolarity controls if the output will be inverted or
//!        not
//!        Valid values are:
//!        - \b COMP_E_NORMALOUTPUTPOLARITY - indicates the output should be
//!           normal
//!        - \b COMP_E_INVERTEDOUTPUTPOLARITY - the output should be inverted
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process
//
//*****************************************************************************
bool COMP_E_init (uint16_t baseAddress,
    uint16_t posTerminalInput,
    uint16_t negTerminalInput,
    uint8_t outputFilterEnableAndDelayLevel,
    uint16_t invertedOutputPolarity)
{
    COMP_E_initializeParam param = {0};
    param.posTerminalInput = posTerminalInput;
    param.negTerminalInput = negTerminalInput;
    param.outputFilterEnableAndDelayLevel = outputFilterEnableAndDelayLevel;
    param.invertedOutputPolarity = invertedOutputPolarity;

